<a href="https://colab.research.google.com/github/TainaraMarques/TainaraMarques/blob/main/banco%20de%20dados.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [406]:
import sqlite3

from platform import python_version

print(python_version())

Conexao = sqlite3.connect('Banco_Dados')

Cursor = Conexao.cursor()

Cursor.execute ('CREATE TABLE alunos ( id INTEGER PRIMARY KEY, nome TEXT NOT NULL, idade INTEGER)')

Conexao.commit()

Cursor.execute ('CREATE TABLE disciplina ( id INTEGER PRIMARY KEY, nome TEXT NOT NULL )')

Conexao.commit()

Cursor.execute ('CREATE TABLE professor ( id INTEGER PRIMARY KEY, nome TEXT NOT NULL )')

Conexao.commit()

Cursor.execute ('CREATE TABLE turma ( id INTEGER PRIMARY KEY, nome TEXT NOT NULL, disciplina_id INTEGER, professor_id INTEGER, FOREIGN KEY (disciplina_id) REFERENCES disciplina(id), FOREIGN KEY (professor_id) REFERENCES professor(id) )')

Conexao.commit()

Cursor.execute ('CREATE TABLE aluno_turma ( aluno_id INTEGER, turma_id INTEGER, FOREIGN KEY (aluno_id) REFERENCES aluno(id), FOREIGN KEY (turma_id) REFERENCES turma(id), PRIMARY KEY (aluno_id, turma_id) )')

Conexao.commit()

3.10.12

In [407]:
#1.Insira um novo aluno na tabela de alunos.
Cursor.execute('INSERT INTO alunos (id, nome, idade) VALUES ("20", "Pietro", "14");')
Cursor.execute('INSERT INTO alunos (id, nome, idade) VALUES ("5", "Leandra", "11");')
Cursor.execute('INSERT INTO alunos (id, nome, idade) VALUES ("7", "Pedro", "12");')
Cursor.execute('INSERT INTO alunos (id, nome, idade) VALUES ("4", "Laura", "14");')
Cursor.execute('INSERT INTO alunos (id, nome, idade) VALUES ("3", "Letícia", "12");')
Cursor.execute('INSERT INTO alunos (id, nome, idade) VALUES ("8", "Clara", "13");')
Cursor.execute('INSERT INTO alunos (id, nome, idade) VALUES ("6", "Carlos", "18")')
Cursor.execute('INSERT INTO alunos (id, nome, idade) VALUES ("10", "Marian", "20")')
Cursor.execute('INSERT INTO alunos (id, nome, idade) VALUES ("11", "Rafael", "22")')
Cursor.execute('INSERT INTO alunos (id, nome, idade) VALUES ("12", "Carla", "19");')
Cursor.execute('INSERT INTO alunos (id, nome, idade) VALUES ("13", "Conor", "13");')
Cursor.execute('INSERT INTO alunos (id, nome, idade) VALUES ("17", "Conor", "13");')
Cursor.execute('INSERT INTO alunos (id, nome, idade) VALUES ("14", "Luiza", "21");')
Cursor.execute('INSERT INTO alunos (id, nome, idade) VALUES ("15", "Felipe", "20");')
Cursor.execute('INSERT INTO alunos (id, nome, idade) VALUES ("19", "Gabriel", "20");')
Conexao.commit()

In [408]:
#2.Adicione uma nova disciplina ao currículo.
Cursor.execute(' INSERT INTO disciplina (id, nome) VALUES ("1", "inglês"); ')
Cursor.execute(' INSERT INTO disciplina (id, nome) VALUES ("2", "física"); ')
Cursor.execute(' INSERT INTO disciplina (id, nome) VALUES ("3", "matemática"); ')
Conexao.commit()

In [409]:
Cursor.execute('INSERT INTO turma (id, nome, disciplina_id, professor_id) VALUES ("7", "turma A","1", "5")')
Cursor.execute('INSERT INTO turma (id, nome, disciplina_id, professor_id) VALUES ("4", "turma B","2", "5")')
Cursor.execute('INSERT INTO turma (id, nome, disciplina_id, professor_id) VALUES ("2", "turma C","3", "3")')
Conexao.commit()

In [410]:
#3.Matricule um aluno em uma nova turma.
Cursor.execute('INSERT INTO aluno_turma (aluno_id, turma_id) VALUES (11, 7);')
Cursor.execute('INSERT INTO aluno_turma (aluno_id, turma_id) VALUES (6, 7);')
Cursor.execute('INSERT INTO aluno_turma (aluno_id, turma_id) VALUES (7, 7);')
Cursor.execute('INSERT INTO aluno_turma (aluno_id, turma_id) VALUES (17, 7);')
Cursor.execute('INSERT INTO aluno_turma (aluno_id, turma_id) VALUES (10, 7);')
Cursor.execute('INSERT INTO aluno_turma (aluno_id, turma_id) VALUES (13, 4);')
Cursor.execute('INSERT INTO aluno_turma (aluno_id, turma_id) VALUES (14, 4);')
Cursor.execute('INSERT INTO aluno_turma (aluno_id, turma_id) VALUES (12, 4);')
Cursor.execute('INSERT INTO aluno_turma (aluno_id, turma_id) VALUES (5, 4);')
Cursor.execute('INSERT INTO aluno_turma (aluno_id, turma_id) VALUES (19, 4);')
Cursor.execute('INSERT INTO aluno_turma (aluno_id, turma_id) VALUES (15, 2);')
Cursor.execute('INSERT INTO aluno_turma (aluno_id, turma_id) VALUES (13, 2);')
Cursor.execute('INSERT INTO aluno_turma (aluno_id, turma_id) VALUES (20, 2);')
Conexao.commit()

In [355]:
#4.Inclua um novo professor ao quadro docente
Cursor.execute('INSERT INTO professor (nome,ID) VALUES ("Angelina", 5)')
Conexao.commit()

In [356]:
Cursor.execute('INSERT INTO professor (nome,ID) VALUES ("Camila", 3)')
Conexao.commit()

In [357]:
Cursor.execute('ALTER TABLE disciplina ADD COLUMN professor_id INTEGER;')
Conexao.commit()

In [358]:
#5.Associe um professor a uma disciplina existente.
Cursor.execute('UPDATE disciplina SET professor_id = 5 WHERE id = 1')
Cursor.execute('UPDATE disciplina SET professor_id = 3 WHERE id = 2')
Cursor.execute('UPDATE disciplina SET professor_id = 3 WHERE id = 3')
Conexao.commit()

In [359]:
#1.Atualize a idade de um aluno.
Cursor.execute('UPDATE alunos SET idade = 15 WHERE id = 11')
Conexao.commit()

In [360]:
#2.Altere o nome de uma disciplina.
Cursor.execute('UPDATE disciplina SET nome = ? WHERE id = ?', ('química', 1))
Conexao.commit()

In [361]:
#3.Modifique o nome de uma turma.
Cursor.execute('UPDATE turma SET nome = ? WHERE id = ?', ('turma D', 4))
Conexao.commit()

In [362]:
#4.Atualize o nome de um professor.
Cursor.execute('UPDATE professor SET nome = ? WHERE id = ?', ('Yohan', 3))
Conexao.commit()

In [363]:
#4.Altere a turma em que um aluno está matriculado.
Cursor.execute('UPDATE aluno_turma SET turma_id = 3 WHERE aluno_id = 15')
Conexao.commit()

In [364]:
#1.Selecione todos os alunos matriculados em uma determinada turma.
Cursor.execute('''
    SELECT alunos.nome
    FROM alunos
    INNER JOIN aluno_turma ON alunos.id = aluno_turma.aluno_id
    WHERE aluno_turma.turma_id = 7
''')
Conexao.commit()
resultados = Cursor.fetchall()

for row in resultados:
    print(row)

('Rafael',)
('Carlos',)
('Pedro',)
('Conor',)
('Marian',)

In [422]:
#2.Liste o nome e a idade de todos os alunos.
Cursor.execute('SELECT nome, idade FROM alunos')
Conexao.commit()
resultados = Cursor.fetchall()

for row in resultados:
    print("Nome:", row)
    print("Idade:", row)

Nome: ('Letícia', 12)
Idade: ('Letícia', 12)
Nome: ('Laura', 14)
Idade: ('Laura', 14)
Nome: ('Leandra', 11)
Idade: ('Leandra', 11)
Nome: ('Carlos', 18)
Idade: ('Carlos', 18)
Nome: ('Pedro', 12)
Idade: ('Pedro', 12)
Nome: ('Clara', 13)
Idade: ('Clara', 13)
Nome: ('Marian', 20)
Idade: ('Marian', 20)
Nome: ('Rafael', 22)
Idade: ('Rafael', 22)
Nome: ('Carla', 19)
Idade: ('Carla', 19)
Nome: ('Conor', 13)
Idade: ('Conor', 13)
Nome: ('Luiza', 21)
Idade: ('Luiza', 21)
Nome: ('Felipe', 20)
Idade: ('Felipe', 20)
Nome: ('Conor', 13)
Idade: ('Conor', 13)
Nome: ('Gabriel', 20)
Idade: ('Gabriel', 20)
Nome: ('Pietro', 14)
Idade: ('Pietro', 14)

In [366]:
#3.Recupere os nomes das disciplinas ministradas por um professor específico.
Cursor.execute('''
    SELECT disciplina.nome
    FROM disciplina
    INNER JOIN turma ON disciplina.id = turma.disciplina_id
    INNER JOIN professor ON turma.professor_id = professor.id
    WHERE professor.nome = ?
''', ('Angelina',))

resultados = Cursor.fetchall()

for row in resultados:
    print("Disciplina:", row)

Disciplina: ('física',)
Disciplina: ('química',)

In [367]:
#4.Encontre os alunos que não estão matriculados em nenhuma turma.
Cursor.execute('''
    SELECT nome
    FROM alunos
    WHERE id NOT IN (SELECT aluno_id FROM aluno_turma)
''')

resultados = Cursor.fetchall()

for row in resultados:
    print("Aluno:", row)

Aluno: ('Letícia',)
Aluno: ('Laura',)
Aluno: ('Clara',)

In [368]:
#5.Obtenha o nome do professor e o número de alunos em cada uma de suas turmas.
Cursor.execute('''
SELECT
    professor.nome AS nome_professor,
    turma.nome AS nome_turma,
    COUNT(aluno_turma.aluno_id) AS numero_alunos
FROM
    professor
INNER JOIN
    turma ON professor.id = turma.professor_id
LEFT JOIN
    aluno_turma ON turma.id = aluno_turma.turma_id
GROUP BY
    professor.nome, turma.nome;
    ''')

resultados = Cursor.fetchall()

for row in resultados:
    print("Nome do Professor:", row)
    print("Nome da Turma:", row)
    print("Número de Alunos:", row)
    print()

Nome do Professor: ('Angelina', 'turma A', 5)
Nome da Turma: ('Angelina', 'turma A', 5)
Número de Alunos: ('Angelina', 'turma A', 5)

Nome do Professor: ('Angelina', 'turma D', 4)
Nome da Turma: ('Angelina', 'turma D', 4)
Número de Alunos: ('Angelina', 'turma D', 4)

Nome do Professor: ('Yohan', 'turma C', 3)
Nome da Turma: ('Yohan', 'turma C', 3)
Número de Alunos: ('Yohan', 'turma C', 3)

In [369]:
#1.Remova um aluno da base de dados.
Cursor.execute('DELETE FROM alunos WHERE id = 12')
Conexao.commit()

In [370]:
#2.Exclua uma disciplina do currículo.
Cursor.execute('DELETE FROM disciplina WHERE id = 2')
Conexao.commit()

In [371]:
#3.Delete uma turma, removendo também os alunos associados a ela.
Cursor.execute('DELETE FROM aluno_turma WHERE turma_id = 4')
Conexao.commit()


Cursor.execute('DELETE FROM turma WHERE id = 4')
Conexao.commit()

print("Turma e alunos associados removidos com sucesso!!!")

Turma e alunos associados removidos com sucesso!!!

In [372]:
#4.Elimine um professor da instituição.
Cursor.execute('DELETE FROM professor WHERE id = 3')
Conexao.commit()

In [373]:
#5.Desvincule um professor de uma disciplina específica.
Cursor.execute('''
    UPDATE turma
    SET professor_id = NULL
    WHERE disciplina_id = 7 AND professor_id = 5
'''),
Conexao.commit()

print("Professor desvinculado da disciplina!!!")

Professor desvinculado da disciplina!!!

In [385]:
#1.Liste os alunos matriculados em cada turma, juntamente com o nome do professor.
Cursor.execute('''
    SELECT alunos.nome AS nome_aluno, disciplina.nome AS nome_disciplina
    FROM alunos
    INNER JOIN aluno_turma ON alunos.id = aluno_turma.aluno_id
    INNER JOIN turma ON aluno_turma.turma_id = turma.id
    INNER JOIN disciplina ON turma.disciplina_id = disciplina.id
''')

resultados = Cursor.fetchall()

if resultados:
    print("Alunos matriculados nas disciplinas:")
    for aluno, disciplina in resultados:
        print("- Aluno:", aluno, "| Disciplina:", disciplina)
else:
    print("Nenhum aluno matriculado encontrado.")

Alunos matriculados nas disciplinas:
- Aluno: Rafael | Disciplina: química
- Aluno: Carlos | Disciplina: química
- Aluno: Pedro | Disciplina: química
- Aluno: Conor | Disciplina: química
- Aluno: Marian | Disciplina: química
- Aluno: Gabriel | Disciplina: matemática
- Aluno: Conor | Disciplina: matemática
- Aluno: Pietro | Disciplina: matemática

In [375]:
#2.Recupere todas as turmas ministradas por um professor específico.
Cursor.execute('''
    SELECT turma.nome AS nome_turma
    FROM turma
    WHERE professor_id = 5
''',)

resultados = Cursor.fetchall()

if resultados:
    print("Turmas ministradas pelo professor:")
    for row in resultados:
        print(row)

Turmas ministradas pelo professor:
- ('turma A',)

In [387]:
#3.Encontre todos os alunos matriculados em disciplinas específicas.
Cursor.execute('''
    SELECT alunos.nome AS nome_aluno, disciplina.nome AS nome_disciplina
    FROM alunos
    INNER JOIN aluno_turma ON alunos.id = aluno_turma.aluno_id
    INNER JOIN turma ON aluno_turma.turma_id = turma.id
    INNER JOIN disciplina ON turma.disciplina_id = disciplina.id
    WHERE disciplina.id IN (1, 2)
''')

resultados = Cursor.fetchall()

if resultados:
    print("Alunos matriculados nas disciplinas específicas:")
    for aluno, disciplina in resultados:
        print("- Aluno:", aluno, "| Disciplina:", disciplina)

Alunos matriculados nas disciplinas específicas:
- Aluno: Rafael | Disciplina: química
- Aluno: Carlos | Disciplina: química
- Aluno: Pedro | Disciplina: química
- Aluno: Conor | Disciplina: química
- Aluno: Marian | Disciplina: química

In [389]:
#4.Obtenha o nome de cada aluno e o nome da disciplina em que está matriculado.
Cursor.execute('''
    SELECT alunos.nome AS nome_aluno, disciplina.nome AS nome_disciplina
    FROM alunos
    INNER JOIN aluno_turma ON alunos.id = aluno_turma.aluno_id
    INNER JOIN turma ON aluno_turma.turma_id = turma.id
    INNER JOIN disciplina ON turma.disciplina_id = disciplina.id
''')

resultados = Cursor.fetchall()

if resultados:
    print("Alunos matriculados nas disciplinas:")
    for aluno, disciplina in resultados:
        print("- Aluno:", aluno, "| Disciplina:", disciplina)

Alunos matriculados nas disciplinas:
- Aluno: Rafael | Disciplina: química
- Aluno: Carlos | Disciplina: química
- Aluno: Pedro | Disciplina: química
- Aluno: Conor | Disciplina: química
- Aluno: Marian | Disciplina: química
- Aluno: Gabriel | Disciplina: matemática
- Aluno: Conor | Disciplina: matemática
- Aluno: Pietro | Disciplina: matemática

In [390]:
#5.Liste os nomes dos alunos e o número de disciplinas em que estão matriculados.
Cursor.execute('''
    SELECT alunos.nome AS nome_aluno, COUNT(aluno_turma.turma_id) AS numero_disciplinas
    FROM alunos
    INNER JOIN aluno_turma ON alunos.id = aluno_turma.aluno_id
    GROUP BY alunos.id
''')

resultados = Cursor.fetchall()

if resultados:
    print("Alunos e número de disciplinas em que estão matriculados:")
    for aluno, num_disciplinas in resultados:
        print("- Aluno:", aluno, "| Número de disciplinas:", num_disciplinas)

Alunos e número de disciplinas em que estão matriculados:
- Aluno: Carlos | Número de disciplinas: 1
- Aluno: Pedro | Número de disciplinas: 1
- Aluno: Marian | Número de disciplinas: 1
- Aluno: Rafael | Número de disciplinas: 1
- Aluno: Conor | Número de disciplinas: 1
- Aluno: Felipe | Número de disciplinas: 1
- Aluno: Conor | Número de disciplinas: 1
- Aluno: Gabriel | Número de disciplinas: 1
- Aluno: Pietro | Número de disciplinas: 1

In [416]:
#1.Encontre as disciplinas que têm o mesmo professor.
Cursor.execute('''
    SELECT professor.nome AS nome_professor, disciplina.nome AS nome_disciplina, COUNT(*) AS num_disciplinas
    FROM professor
    INNER JOIN turma ON professor.id = turma.professor_id
    INNER JOIN disciplina ON turma.disciplina_id = disciplina.id
    GROUP BY professor.id, disciplina.id
    HAVING COUNT(*) > 1
''')

resultados = Cursor.fetchall()

if resultados:
    print("Disciplinas com o mesmo professor:")
    for professor, disciplina, num_disciplinas in resultados:
        print("- Professor:", professor, "| Disciplina:", disciplina, "| Número de disciplinas:", num_disciplinas)

else:
    print("Não há disciplinas com o mesmo professor.")

Não há disciplinas com o mesmo professor.

In [417]:
#2.Recupere os alunos que estão matriculados em mais de uma turma.
Cursor.execute('''
    SELECT alunos.nome AS nome_aluno, COUNT(aluno_turma.turma_id) AS num_turmas
    FROM alunos
    INNER JOIN aluno_turma ON alunos.id = aluno_turma.aluno_id
    GROUP BY alunos.id
    HAVING COUNT(aluno_turma.turma_id) > 1
''')

resultados = Cursor.fetchall()

if resultados:
    print("Alunos matriculados em mais de uma turma:")
    for aluno, num_turmas in resultados:
        print("Aluno:", aluno, "Número de turmas:", num_turmas)
else:
    print("Nenhum aluno matriculado em mais de uma turma encontrado.")

Alunos matriculados em mais de uma turma:
Aluno: Conor Número de turmas: 2
Aluno: Pietro Número de turmas: 2

In [418]:
#3.Liste os professores que não estão associados a nenhuma disciplina.
Cursor.execute('''
    SELECT professor.nome AS nome_professor
    FROM professor
    LEFT JOIN turma ON professor.id = turma.professor_id
    WHERE turma.professor_id IS NULL
''')

resultados = Cursor.fetchall()

if resultados:
    print("Professores não associados a nenhuma disciplina:")
    for professor in resultados:
        print("Professor:", professor)
else:
    print("Todos os professores estão associados a disciplinas.")

Todos os professores estão associados a disciplinas.

In [419]:
#4.Encontre as turmas com menos de 5 alunos matriculados.
Cursor.execute('''
    SELECT turma.nome AS nome_turma, COUNT(aluno_turma.aluno_id) AS num_alunos
    FROM turma
    LEFT JOIN aluno_turma ON turma.id = aluno_turma.turma_id
    GROUP BY turma.id
    HAVING COUNT(aluno_turma.aluno_id) < 5
''')

resultados = Cursor.fetchall()

if resultados:
    print("Turmas com menos de 5 alunos matriculados:")
    for turma, num_alunos in resultados:
        print("Turma:", turma, "| Número de alunos:", num_alunos)

Turmas com menos de 5 alunos matriculados:
Turma: turma C | Número de alunos: 3

In [421]:
#5.Obtenha o nome do aluno mais jovem matriculado em cada turma.
Cursor.execute('''
    SELECT turma.nome AS nome_turma, alunos.nome AS nome_aluno, alunos.idade AS idade_aluno
    FROM turma
    INNER JOIN aluno_turma ON turma.id = aluno_turma.turma_id
    INNER JOIN alunos ON aluno_turma.aluno_id = alunos.id
    INNER JOIN (
        SELECT aluno_turma.turma_id, MIN(alunos.idade) AS idade_minima
        FROM aluno_turma
        INNER JOIN alunos ON aluno_turma.aluno_id = alunos.id
        GROUP BY aluno_turma.turma_id
    ) AS subquery ON aluno_turma.turma_id = subquery.turma_id AND alunos.idade = subquery.idade_minima
''')

resultados = Cursor.fetchall()

if resultados:
    print("Nome do aluno mais jovem em cada turma:")
    for turma, aluno, idade in resultados:
        print("- Turma:", turma, "| Aluno mais jovem:", aluno, "| Idade:", idade)

Nome do aluno mais jovem em cada turma:
- Turma: turma A | Aluno mais jovem: Pedro | Idade: 12
- Turma: turma B | Aluno mais jovem: Leandra | Idade: 11
- Turma: turma C | Aluno mais jovem: Conor | Idade: 13